Repository: ShamiNet/drone_academy
Catalog: lib/l10n/app_*.arb
Languages: ar, ru

source: Active
ar: نشط
ru: Активный

source: Admin
ar: مدير
ru: Администратор

source: No results found.
ar: لم يتم العثور على نتائج.
ru: Результаты не найдены.

source: Trainees
ar: المتدربين
ru: Стажеры

source: Active Competition
ar: مسابقة نشطة
ru: Активное соревнование

# activeCompetitionSubtitle
source: Allow trainees to participate in this competition.
ar: السماح للمتدربين بالمشاركة في هذه المسابقة.
ru: Разрешить стажерам участвовать в этом соревновании.

source: Add Competition
ar: إضافة مسابقة
ru: Добавить соревнование

source: Add Session
ar: إضافة جلسة
ru: Добавить сессию

source: Add Daily Note
ar: إضافة ملاحظة يومية
ru: Добавить ежедневную заметку

source: Add New Competition
ar: إضافة مسابقة جديدة
ru: Добавить новое соревнование

source: Add New Node
ar: إضافة عنصر جديد
ru: Добавить новый узел

source: Add New Training
ar: إضافة تدريب جديد
ru: Добавить новую тренировку

source: Add Node Below
ar: إضافة عنصر فرعي
ru: Добавить узел ниже

source: Add Root Node
ar: إضافة عنصر رئيسي
ru: Добавить корневой узел

source: Add Training
ar: إضافة تدريب
ru: Добавить тренировку

source: Add Training Result
ar: إضافة نتيجة تدريب
ru: Добавить результат тренировки

source: Admin Dashboard
ar: لوحة تحكم المدير
ru: Панель администратора

# appTitle
source: Drone Academy
ar: أكاديمية الدرون
ru: Академия Дронов

# areYouSureDelete
source: Are you sure you want to delete this?
ar: هل أنت متأكد من رغبتك في الحذف؟
ru: Вы уверены, что хотите удалить это?

source: Cancel
ar: إلغاء
ru: Отмена

source: Check back later!
ar: تحقق مرة أخرى لاحقاً!
ru: Загляните позже!

source: Competitions
ar: المسابقات
ru: Соревнования

source: Confirm Deletion
ar: تأكيد الحذف
ru: Подтвердить удаление

source: Create New Account
ar: إنشاء حساب جديد
ru: Создать новый аккаунт

source: Daily Notes
ar: الملاحظات اليومية
ru: Ежедневные заметки

source: Delete
ar: حذف
ru: Удалить

source: Delete Node
ar: حذف العنصر
ru: Удалить узел

# dontHaveAccount
source: Don't have an account? Sign Up
ar: ليس لديك حساب؟ إنشاء حساب
ru: Нет аккаунта? Зарегистрироваться

source: Edit
ar: تعديل
ru: Редактировать

source: Edit Competition
ar: تعديل المسابقة
ru: Редактировать соревнование

source: Edit Node
ar: تعديل العنصر
ru: Редактировать узел

source: Edit Profile
ar: تعديل الملف الشخصي
ru: Редактировать профиль

source: Edit Role for
ar: تعديل دور
ru: Редактировать роль для

source: Edit Training
ar: تعديل التدريب
ru: Редактировать тренировку

source: Edit Step
ar: تعديل الخطوة
ru: Редактировать шаг

source: View Manual
ar: عرض الدليل
ru: Просмотреть руководство

source: Recenter View
ar: إعادة توسيط العرض
ru: Переместить вид в центр

source: Save as Image
ar: حفظ كصورة
ru: Сохранить как изображение

source: Email
ar: البريد الإلكتروني
ru: Электронная почта

# enterDescription
source: Please enter a description
ar: الرجاء إدخال الوصف
ru: Пожалуйста, введите описание

# enterLevel
source: Please enter a level
ar: الرجاء إدخال المستوى
ru: Пожалуйста, введите уровень

source: Enter note here...
ar: أدخل الملاحظة هنا...
ru: Введите заметку здесь...

# enterTitle
source: Please enter a title
ar: الرجاء إدخال العنوان
ru: Пожалуйста, введите название

# enterValidNumber
source: Please enter a valid number
ar: الرجاء إدخال رقم صحيح
ru: Пожалуйста, введите действительный номер

source: Full Name
ar: الاسم الكامل
ru: Полное имя

source: Home
ar: الرئيسية
ru: Главная

source: I am a Trainee
ar: أنا متدرب
ru: Я стажер

source: I am a Trainer
ar: أنا مدرب
ru: Я тренер

source: Inactive
ar: غير نشط
ru: Неактивный

source: Level
ar: المستوى
ru: Уровень

source: Loading...
ar: جاري التحميل...
ru: Загрузка...

source: Login
ar: تسجيل الدخول
ru: Войти

source: Logout
ar: تسجيل الخروج
ru: Выйти

source: Mastery
ar: الإتقان
ru: Мастерство

source: My Progress
ar: تقدمي
ru: Мой прогресс

source: Mastery Percentage
ar: نسبة الإتقان
ru: Процент мастерства

source: Name
ar: الاسم
ru: Имя

# noActiveCompetitions
source: No active competitions right now.
ar: لا توجد مسابقات نشطة حالياً.
ru: В данный момент нет активных соревнований.

# noDataToBuildChart
source: No data found to build the chart.
ar: لا توجد بيانات لبناء الهيكل.
ru: Нет данных для построения схемы.

# noNotesRecorded
source: No notes recorded yet.
ar: لم يتم تسجيل أي ملاحظات بعد.
ru: Заметки еще не записаны.

# noResultsRecorded
source: No results recorded yet.
ar: لم يتم تسجيل أي نتائج بعد.
ru: Результаты еще не записаны.

source: Not yet trained
ar: لم يتم التدريب بعد
ru: Еще не обучены

source: No results recorded yet. Check back later!
ar: لم يتم تسجيل أي نتائج بعد. تحقق مرة أخرى لاحقاً!
ru: Результаты еще не записаны. Загляните позже!

# noTrainees
source: No trainees found
ar: لم يتم العثور على متدربين
ru: Стажеры не найдены

source: No trainees found.
ar: لا يوجد متدربون.
ru: Стажеры не найдены.

source: No results yet.
ar: لا توجد نتائج بعد.
ru: Результаты еще не получены.

# noTrainingsAvailable
source: No trainings available yet.
ar: لا توجد تدريبات متاحة بعد.
ru: Тренировки еще не добавлены.

source: No users found.
ar: لا يوجد مستخدمون.
ru: Пользователи не найдены.

source: Note
ar: ملاحظة
ru: Заметка

source: Organizational Structure
ar: الهيكل التنظيمي
ru: Организационная структура

source: Password
ar: كلمة المرور
ru: Пароль

source: Profile picture updated!
ar: تم تحديث الصورة الشخصية!
ru: Изображение профиля обновлено!

source: Results
ar: النتائج
ru: Результаты

source: Role
ar: الدور
ru: Роль

source: Save
ar: حفظ
ru: Сохранить

source: Save Changes
ar: حفظ التغييرات
ru: Сохранить изменения

# searchCompetition
source: Search for a competition...
ar: ابحث عن مسابقة...
ru: Поиск соревнования...

# searchTrainee
source: Search for a trainee...
ar: ابحث عن متدرب...
ru: Поиск стажера...

# searchTraining
source: Search for a training...
ar: ابحث عن تدريب...
ru: Поиск тренировки...

source: Select Competition to Start
ar: اختر مسابقة لتبدأ
ru: Выберите соревнование для начала

source: Select Training
ar: اختر تدريباً
ru: Выберите тренировку

source: Select your role:
ar: اختر دورك:
ru: Выберите вашу роль:

source: Sign Up
ar: إنشاء حساب
ru: Зарегистрироваться

source: Schedule
ar: الجدول
ru: Расписание

source: No schedule available.
ar: لا يوجد جدول متاح.
ru: Расписание не найдено.

source: Start Competition Test
ar: بدء اختبار مسابقة
ru: Начать тест соревнования

source: Training
ar: التدريب
ru: Тренировка

source: Trainers
ar: المدربون
ru: Тренеры

# date
source: التاريخ
ru: Дата

# endTime
source: وقت الانتهاء
ru: Время окончания

# sessionTitle
source: عنوان الحصة
ru: Название сессии

# startTime
source: وقت البدء
ru: Время начала

# trainer
source: المدرب
ru: Тренер

source: Title
ar: العنوان
ru: Название

source: Description
ar: الوصف
ru: Описание

source: Trainings
ar: التدريبات
ru: Тренировки

source: Users
ar: المستخدمون
ru: Пользователи

source: Welcome!
ar: أهلاً بك!
ru: Добро пожаловать!

source: Move Node
ar: نقل العنصر
ru: Переместить узел

# noStepsAdded
source: No steps added for this training yet.
ar: لم يتم إضافة خطوات لهذا التدريب بعد.
ru: Шагов для этой тренировки еще нет.

source: OK
ar: موافق
ru: ОК

source: Training Steps
ar: خطوات التدريب
ru: Шаги тренировки

# noStepsYet
source: No steps yet. Start by adding some steps!
ar: لا توجد خطوات بعد. ابدأ بإضافة بعض الخطوات!
ru: Шагов еще нет. Начните с добавления нескольких шагов!

source: Select New Parent
ar: اختر المسؤول الجديد
ru: Выберите нового родителя

# noOtherNodesAvailable
source: No other nodes available to move to.
ar: لا توجد عناصر أخرى متاحة للنقل إليها.
ru: Нет других узлов для перемещения.

# cannotMoveNodeToItself
source: Cannot move a node to be under itself.
ar: لا يمكن نقل العنصر ليكون تحت نفسه.
ru: Невозможно переместить узел на себя.

source: Users Org Chart
ar: الهيكل التنظيمي للمستخدمين
ru: Оргструктура пользователей

source: Competitions Org Chart
ar: الهيكل التنظيمي للمسابقات
ru: Оргструктура соревнований

source: Trainings Org Chart
ar: الهيكل التنظيمي للتدريبات
ru: Оргструктура тренировок

source: Export as PDF
ar: تصدير كملف PDF
ru: Экспорт в PDF

source: Add User
ar: إضافة مستخدم
ru: Добавить пользователя

source: Create User
ar: إنشاء مستخدم
ru: Создать пользователя

# passwordMinChars
source: Password (at least 6 characters)
ar: كلمة المرور (6 أحرف على الأقل)
ru: Пароль (минимум 6 символов)

source: Select Competition to View Leaderboard
ar: اختر مسابقة لعرض لوحة المتصدرين
ru: Выберите соревнование для просмотра таблицы лидеров

source: Leaderboard
ar: لوحة المتصدرين
ru: Таблица лидеров

source: Trainings Completed
ar: التدريبات المكتملة
ru: Завершенные тренировки

source: Score Evolution
ar: تطور النقاط
ru: Эволюция очков

source: View Details
ar: عرض التفاصيل
ru: Просмотреть детали

source: Select Training to See Progress
ar: اختر تدريب لعرض التقدم
ru: Выберите тренировку, чтобы увидеть прогресс

source: Latest Score:
ar: أحدث نتيجة:
ru: Последний счет:

source: Score
ar: النتيجة
ru: Счет

# manageSteps
source: Manage Training Steps
ar: إدارة خطوات التدريب
ru: Управление шагами тренировки

source: Add Step
ar: إضافة خطوة
ru: Добавить шаг

source: Step Title
ar: عنوان الخطوة
ru: Название шага

source: Step Type
ar: نوع الخطوة
ru: Тип шага

# checklist
source: Checklist (text)
ar: قائمة تحقق (نص)
ru: Чек-лист (текст)

source: Video
ar: فيديو
ru: Видео

source: Language
ar: اللغة
ru: Язык

source: Select Language
ar: اختر اللغة
ru: Выберите язык

# videoUrl
source: Video URL (YouTube example)
ar: رابط الفيديو (يوتيوب مثلاً)
ru: Ссылка на видео (YouTube например)

source: No results to analyze.
ar: لا توجد نتائج كافية لتحليلها.
ru: Нет результатов для анализа.

source: Get Recommendation
ar: احصل على توصية
ru: Получить рекомендацию

source: Analyzing...
ar: جاري التحليل...
ru: Анализируется...

source: AI Recommendation
ar: توصية المدرب الذكي
ru: Рекомендация ИИ

# allTrainingsCompleted
source: Congratulations! You have mastered all available trainings.
ar: تهانينا! لقد أتقنت جميع التدريبات المتاحة.
ru: Поздравляем! Вы освоили все доступные тренировки.

source: No notes recorded yet. Check back later!
ar: لم يتم تسجيل أي ملاحظات بعد. تحقق مرة أخرى لاحقاً!
ru: Заметки еще не записаны. Загляните позже!

source: Move to Top
ar: نقل للأعلى
ru: Переместить вверх

source: Move Up
ar: تحريك للأعلى
ru: Поднять

source: Move Down
ar: تحريك للأسفل
ru: Опустить

source: Crop Image
ar: قص الصورة
ru: Обрезать изображение

source: Equipment
ar: المعدات
ru: Оборудование

source: Manage Equipment
ar: إدارة المعدات
ru: Управление оборудованием

source: Add Equipment
ar: إضافة قطعة جديدة
ru: Добавить оборудование

source: Edit Equipment
ar: تعديل قطعة معدات
ru: Редактировать оборудование

# equipmentName
source: Equipment Name (or Serial Number)
ar: اسم القطعة (أو الرقم التسلسلي)
ru: Название оборудования (или серийный номер)

source: Equipment Type
ar: نوع القطعة
ru: Тип оборудования

source: Status
ar: الحالة
ru: Статус

source: Drone
ar: طائرة درون
ru: Дрон

source: Battery
ar: بطارية
ru: Батарея

source: Controller
ar: جهاز تحكم
ru: Контроллер

source: Other
ar: أخرى
ru: Другое

source: Available
ar: متاح
ru: Доступно

source: In Use
ar: قيد الاستخدام
ru: Используется

source: In Maintenance
ar: في الصيانة
ru: В ремонте

# notes
source: Notes (optional)
ar: ملاحظات (اختياري)
ru: Заметки (необязательно)

# totalFlightHours
source: Total Flight Hours (optional)
ar: مجموع ساعات الطيران (اختياري)
ru: Общее время полета (необязательно)

# totalChargeCycles
source: Total Charge Cycles (for Batteries)
ar: دورات الشحن (للبطاريات)
ru: Общее количество зарядов (для батарей)

# lastMaintenanceDate
source: Last Maintenance Date (optional)
ar: تاريخ آخر صيانة (اختياري)
ru: Дата последней ремонта (необязательно)

source: No equipment added yet.
ar: لم يتم إضافة أي معدات بعد.
ru: Оборудование еще не добавлено.

source: Lookup
ar: بحث
ru: Поиск

source: Check Out
ar: استعارة
ru: Выдача

source: Check In
ar: إرجاع
ru: Возврат

source: Checked Out By
ar: مستعار من قبل
ru: Выдано

source: Equipment Log
ar: سجل المعدات
ru: Журнал оборудования

source: Check In Item
ar: إرجاع القطعة
ru: Возврат оборудования

# notesOnReturn
source: Notes on Return (e.g., battery low, minor crack...)
ar: ملاحظات عند الإرجاع (مثال: البطارية ضعيفة، كسر بسيط...)
ru: Заметки при возврате (например: разряженная батарея, незначительный трещина...)

source: Set Final Status
ar: تحديد الحالة النهائية
ru: Установить окончательный статус

# reportMaintenance
source: Report Maintenance (Send for Repair)
ar: إبلاغ عن عطل (إرسال للصيانة)
ru: Сообщить о неисправности (отправить на ремонт)

source: Equipment History
ar: سجل تاريخ المعدات
ru: История оборудования

source: Checked Out
ar: تم الاستعارة
ru: Выдано

source: Checked In
ar: تم الإرجاع
ru: Возвращено

source: Unknown Equipment
ar: معدات غير معروفة
ru: Неизвестное оборудование

source: Item Name
ar: اسم القطعة
ru: Название оборудования

# addInventoryItem
source: Add to Inventory
ar: إضافة قطعة للمخزون
ru: Добавить в инвентарь

# editInventoryItem
source: Edit in Inventory
ar: تعديل قطعة في المخزون
ru: Редактировать в инвентаре

# deleteInventoryItem
source: Delete from Inventory
ar: حذف قطعة من المخزون
ru: Удалить из инвентаря

source: Total Quantity
ar: الكمية الإجمالية
ru: Общее количество

source: Available Quantity
ru: Доступное количество

source: No inventory items.
ar: لا توجد قطع في المخزون.
ru: В инвентаре нет оборудования.

source: Inventory
ar: المخزون
ru: Инвентарь

source: Quantity to Checkout
ar: الكمية المراد سحبها
ru: Количество для выдачи

source: Quantity to Return
ar: الكمية المرجعة
ru: Количество для возврата

# quantityLost
source: Quantity Lost/Damaged
ar: الكمية المفقودة/التالفة
ru: Количество потерянных/поврежденных

# notEnoughStock
source: Not in stock. Available Quantity:
ar: لا يوجد مخزون كافٍ. الكمية المتاحة:
ru: Нет в наличии. Доступное количество:

# checkoutSuccess
source: Checkout Successful
ar: تم السحب بنجاح
ru: Выдача успешно завершена

# returnSuccess
source: Return Successful
ar: تم الإرجاع بنجاح
ru: Возврат успешно завершен

source: History
ar: السجل
ru: История

source: All
ar: الكل
ru: Все

source: Cannot be greater than
ar: لا يمكن أن تكون أكبر من
ru: Не может быть больше чем

source: Move to Bottom
ar: نقل للأسفل
ru: Переместить вниз

# quantityError
source: Quantity to return cannot be greater than checked out quantity.
ar: الكمية المراد إرجاعها لا يمكن أن تكون أكبر من الكمية المسحوبة.
ru: Количество для возврата не может быть больше чем количество для выдачи.

source: Inventory History
ar: سجل حركات المخزون
ru: Список изменений инвентаря

# noHistoryFound
source: No history found for this item.
ar: لا يوجد سجل تاريخي لهذا الصنف.
ru: История не найдена для этого оборудования.

source: All Roles
ar: جميع الأدوار
ru: Все роли

source: Manager
ar: مدير
ru: Менеджер

source: All Managers
ar: جميع المديرين
ru: Все менеджеры

source: Filter by Manager
ar: تصفية حسب المدير
ru: Фильтр по менеджеру

source: Edit Daily Note
ar: تعديل الملاحظة اليومية
ru: Редактировать ежедневную заметку

source: Sort by Mastery
ar: ترتيب حسب الإتقان
ru: Сортировать по мастерству

source: Sort by Date
ar: ترتيب حسب التاريخ
ru: Сортировать по дате

source: Sort by Level
ar: ترتيب حسب المستوى
ru: Сортировать по уровню

source: Sort by Name
ar: ترتيب حسب الاسم
ru: Сортировать по имени

source: Comprehensive Report
ar: تقرير شامل
ru: Комплексный отчет

source: Favorites
ar: المفضلة
ru: Избранное

source: Export
ar: تصدير
ru: Экспорт

source: Config saved!
ar: تم حفظ الإعدادات!
ru: Настройки сохранены!

source: Unblock User
ar: إلغاء حظر المستخدم
ru: Разблокировать пользователя

source: Block User
ar: حظر المستخدم
ru: Заблокировать пользователя

# reportSavedSuccessfully
source: Report saved successfully in Downloads.
ar: تم حفظ التقرير بنجاح في التنزيلات.
ru: Отчет успешно сохранен в Скачиваниях.

# enterUrl
source: Please enter an update URL
ar: الرجاء إدخال رابط التحديث
ru: Пожалуйста, введите URL для обновления

source: Update Message
ar: رسالة التحديث
ru: Сообщение об обновлении

source: Update URL
ar: رابط التحديث
ru: URL для обновления

source: Share
ru: Поделиться

source: Save Config
ar: حفظ الإعدادات
ru: Сохранить настройки

# maintenanceMessage
source: App is in maintenance mode. Please try again later.
ar: التطبيق في وضع الصيانة. يرجى المحاولة لاحقاً.
ru: Приложение находится в режиме обслуживания. Пожалуйста, попробуйте позже.

source: Force Update
ar: فرض التحديث
ru: Принудительное обновление

source: App Enabled
ar: التطبيق ممكّن
ru: Приложение включено

source: App Control
ar: إعدادات التطبيق
ru: Управление приложением

source: Save to Downloads
ru: Сохранить в Скачиваниях

source: Preview and Print
ru: Предпросмотр и печать

# reportReadyTitle
source: Report Ready
ru: Отчет готов

# reportSavedSuccess
source: Report saved successfully in Downloads.
ru: Отчет успешно сохранен в Скачиваниях.

# reportReadyContent
source: Your comprehensive report has been generated successfully. You can now export or share it as you wish.
ru: Ваш комплексный отчет был успешно создан. Теперь вы можете экспортировать или поделиться им по своему усмотрению.

source: Analyze Notes Now
ar: تحليل الملاحظات الآن
ru: Анализировать заметки сейчас

source: Operations
ar: العمليات
ru: Операции

source: Success
ar: نجاح
ru: Успешно

source: Report generated successfully.
ar: تم إنشاء التقرير بنجاح.
ru: Отчет успешно создан.

source: Failed
ar: فشل
ru: Ошибка

# exportFailed
source: Export failed. Please try again.
ar: فشل التصدير. حاول مرة أخرى.
ru: Экспорт не удался. Попробуйте еще раз.

# exportStarting
source: Exporting...
ar: جاري التصدير...
ru: Начинается экспорт...

source: Export Backup
ar: تصدير النسخة الاحتياطية
ru: Экспорт резервной копии

source: Import Backup
ar: استيراد النسخة الاحتياطية
ru: Импорт резервной копии

source: Inventory List
ar: قائمة المخزون
ru: Список инвентаря

source: Select Trainee
ar: اختر متدرباً
ru: Выберите стазера

source: With AI Analysis
ar: تحليل مع الذكاء الاصطناعي
ru: С анализом ИИ

source: Without AI Analysis
ar: بدون تحليل الذكاء الاصطناعي
ru: Без анализа ИИ

source: Include AI Analysis
ar: تضمين تحليل الذكاء الاصطناعي
ru: Включить анализ ИИ

source: AI Performance Analysis
ar: تحليل أداء الذكاء الاصطناعي
ru: Анализ производительности ИИ

# reportGenerationFailed
source: Report generation failed. Try again.
ar: فشل في إنشاء التقرير. حاول مرة أخرى.
ru: Не удалось создать отчет. Попробуйте еще раз.

# generatingComprehensiveReport
source: Generating comprehensive report. This may take a few minutes...
ar: جاري إنشاء التقرير الشامل. قد يستغرق الأمر بضع دقائق...
ru: Генерация комплексного отчета. Это может занять несколько минут...

# showOnlyWithResults
source: Show Trainings with Results Only
ar: عرض التدريبات التي تحتوي على نتائج فقط
ru: Показывать только тренировки с результатами

# negativeQuantityError
source: Quantity cannot be negative.
ar: الكمية لا يمكن أن تكون سالبة.
ru: Количество не может быть отрицательным.

# userUnblocked
source: User has been unblocked.
ar: تم إلغاء حظر المستخدم بنجاح.

# userBlocked
source: User has been blocked.
ar: تم حظر المستخدم بنجاح.
